# BaseImportOptions Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
BaseImportOptions Class
Members See Also
---
A base class containing import options used during import of several formats.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class BaseImportOptions : IDisposable
```

Visual Basic
---
```text
Public Class BaseImportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BaseImportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BaseImportOptions Autodesk.Revit.DB..::..DGNImportOptions Autodesk.Revit.DB..::..DWGImportOptions Autodesk.Revit.DB..::..ImportOptions3DM Autodesk.Revit.DB..::..SATImportOptions Autodesk.Revit.DB..::..SKPImportOptions
# See Also
BaseImportOptions Members
Autodesk.Revit.DB Namespace